package java05_array.array2D;

public class Array2D_04 {

	public static void main(String[] args) {
		// 학생 성적 관리 프로그램
		// 국영수 3과목의 점수
		
		// 점수 1개 - int
		// 3과목 점수 - int[3]
		// 4명의 학생 - int[4][3]
		// 2개의 학급 - int[2][4][3]
		// 1-3 학년 - int[3][2][4][3]
		
		int[][][][] sco = new int[3][2][4][3];
		
		//----------------------------------------------------------------------------------------------------
		
		int[][][] sco1 = new int [2][4][3];
		int[][][] sco2 = new int [2][4][3];
		int[][][] sco3 = new int [2][4][3];

		//----------------------------------------------------------------------------------------------------
		
	}

}
