package squidgame;

public class GamePlan {
	// 배운 array 배열과 switch 구문 do while 구문과 for 구문 ( ; ? ) 구문 ...등을 이용해서
	// 오징어게임 징검다리 건너기 게임을 만들어 보려한다.
	
	// 시작은 do while {switch} 구문으로 시작하려면 아무키나 입력 종료를 원할시에 특정키를 누르면 작동하도록 제어한다.
	// 각 변수는 boolean_array 구문으로 밟은 유리창이 올바른 유리창이면 true 아니면 false를 적용시켜서 false의 경우 게임오버가 뜨도록 한다.
	// for 구문을 이용해서 true,false 값을 구분한다. 증감을 통해 반영한다.
	// for 구문을 이용해서 목숨을 적용시켜본다. 목숨을 다 소모하기전에 끝까지 이동하면 승리
	// 출력구문을 통해서 GAMEOVER창과 캐릭터가 이동하는 
	// 이전에 예습한 객체지향을 통해서 객체지향형으로 만들어보려고한다. 하나 class에 모든 파일을 담는게 아니라 class를 여러개 만들어 참조형을
	// 이용해서 제작 해보려한다.
	// 단순히 운만 시험하는 게임이 아니라 영어 타이핑을 안보고 할 수 있는지도 시험하려고한다.
	// 따라서 타이핑이 옳을 경우엔 생존 실패할 경우엔 게임오버처리 // [a] [b] 인데 c 를 입력해도 사망
	// 타이핑 할 때마다 타이핑 친 값을 저장하고 게임 마지막에 타이핑 쳤던 문구들을 합쳐서 보여준다.
	// t/ hewor / ldisn / otdec / idedb / yluck

}
