package java06_class.method;

public class Method_02 {
	//매개변수(Parameter)
	// -> 메소드 기능의 입력 데이터로 사용된다.
	
	//반환데이터(Return Data)
	// -> 메소드 기능의 출력 데이터로 사용된다.
	//-------------------------------------------------------------------------------------------------------
	
	//매개변수 X - 비워둔다
	//반환데이터 X - void타입으로 정한다.
	
	public void method1() {
		System.out.println("Hello");
	}
	//-------------------------------------------------------------------------------------------------------

	//매개변수 0
	//반환데이터 X - void타입으로 정한다.
	public void method2(int parameter) {
		System.out.println("전달된 값 : " + parameter);
	}
	//-------------------------------------------------------------------------------------------------------
	
	//매개변수 X
	//반환데이터 0
	
	//** 반환데이터타입을 void가 아닌 타입으로 명시하면
	// 반드시 return 코드를 작성해야한다.
	public int method3() {
		return 123; 
	}
	//-------------------------------------------------------------------------------------------------------
	
	//매개변수 0
	//반환데이터 0
	
	public int method4(int n1,int n2) {
		return n1+n2;
	}
}
